Revit 2025 API
EndTreatmentType.Create(Document) Method
 Creates a new EndTreatmentType in a document.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static EndTreatmentType Create(
	Document doc
)
Public Shared Function Create (
	doc As Document
) As EndTreatmentType
public:
static EndTreatmentType^ Create(
	Document^ doc
)
static member Create :
        doc : Document -> EndTreatmentType
Parameters
doc Document
Return Value
EndTreatmentType
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
EndTreatmentType Class
Create Overload
Autodesk.Revit.DB.Structure Namespace